Autodesk.Revit.DB.Macros.ApplicationMacroOptions
The application macro options.
Since:
2014
Since:
2014

Autodesk.Revit.DB.Macros.ApplicationMacroOptions.DisableMacros
The option to disable macros for the application.

Autodesk.Revit.DB.Macros.ApplicationMacroOptions.EnableMacros
The option to enable macros for the application.